---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomPhaseId
source: html/3b2163e0-fe34-a8a2-6c57-6d39e7769021.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomPhaseId Property

"Phase Id"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomPhaseId { get; }
```